#### In this Hands-On exercise, you will create a project which will solidify your understanding of decision trees and random forests. This Hands-On will be completed in Python, using your text editor or IDE of choice

#### Create a decision tree model of the Titanic dataset that predicts survival from seaborn.

In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score

In [60]:
titanic = sns.load_dataset('titanic')

#### Make sure to complete the following wrangling tasks:

Recode string data

Remove missing data

Drop any variables that are redundant and will add to multicollinearity.
Once you have created a decision tree model, interpret the confusion matrix and classification report.

In [61]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [62]:
titanic.value_counts()

survived  pclass  sex     age   sibsp  parch  fare      embarked  class  who    adult_male  deck  embark_town  alive  alone
1         1       female  24.0  0      0      69.3000   C         First  woman  False       B     Cherbourg    yes    True     2
                          58.0  0      0      26.5500   S         First  woman  False       C     Southampton  yes    True     1
                          49.0  0      0      25.9292   S         First  woman  False       D     Southampton  yes    True     1
                                1      0      76.7292   C         First  woman  False       D     Cherbourg    yes    False    1
                          50.0  0      1      247.5208  C         First  woman  False       B     Cherbourg    yes    False    1
                                                                                                                              ..
                          16.0  0      0      86.5000   S         First  woman  False       B     Southampton  yes    True     1
                                       1      39.4000   S         First  woman  False       D     Southampton  yes    False    1
                                              57.9792   C         First  woman  False       B     Cherbourg    yes    False    1
                          17.0  1      0      57.0000   S         First  woman  False       B     Southampton  yes    False    1
          3       male    32.0  0      0      8.0500    S         Third  man    True        E     Southampton  yes    True     1
Length: 181, dtype: int64

#### drop redundant columns so we don't introduce multicollinearity with columns that are too similar.

#### titanic.drop(['deck', 'embark_town', 'class', 'sex', 'adult_male', 'who', 'alone', 'alive'], axis=1, inplace=True)

In [63]:
titanic = titanic.iloc[:, :7]

In [64]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

#### recode sex gender

In [65]:
titanic = pd.get_dummies(titanic)

In [66]:
titanic.head()

   survived  pclass   age  sibsp  parch     fare  sex_female  sex_male
0         0       3  22.0      1      0   7.2500           0         1
1         1       1  38.0      1      0  71.2833           1         0
2         1       3  26.0      0      0   7.9250           1         0
3         1       1  35.0      1      0  53.1000           1         0
4         0       3  35.0      0      0   8.0500           0         1

#### make sure everything is an integer or float

In [67]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   age         714 non-null    float64
 3   sibsp       891 non-null    int64
 4   parch       891 non-null    int64
 5   fare        891 non-null    float64
 6   sex_female  891 non-null    uint8
 7   sex_male    891 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 43.6 KB

#### drop any missing or null values

In [68]:
titanic.dropna(inplace=True)

#### define x and y variables

In [69]:
x = titanic[['pclass', 'age', 'sibsp', 'parch', 'fare', 'sex_female', 'sex_male']]
y = titanic ['survived']

In [70]:
x.head()

   pclass   age  sibsp  parch     fare  sex_female  sex_male
0       3  22.0      1      0   7.2500           0         1
1       1  38.0      1      0  71.2833           1         0
2       3  26.0      0      0   7.9250           1         0
3       1  35.0      1      0  53.1000           1         0
4       3  35.0      0      0   8.0500           0         1

In [71]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

#### train test split

In [72]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = .3)

#### Create initial decision tree

In [73]:
decisionTree = DecisionTreeClassifier()
decisionTree.fit(x_train, y_train)

DecisionTreeClassifier()

#### now that the data is fit, next step is to create a set of predictions and interpret the results.

In [74]:
treePredictions = decisionTree.predict(x_test)

In [75]:
print(confusion_matrix(y_test, treePredictions))

[[111  21]
 [ 30  53]]

#### print out classification report

In [76]:
print(classification_report(y_test, treePredictions))

              precision    recall  f1-score   support

           0       0.79      0.84      0.81       132
           1       0.72      0.64      0.68        83

    accuracy                           0.76       215
   macro avg       0.75      0.74      0.74       215
weighted avg       0.76      0.76      0.76       215

#### The survival rate for males (zeroes) is predicted accurately by the model 79% of the time. Survival of females was predicted accurately 72% of the time. Looking at the f1-score, males' survival was predicted with 81% accuracy while female survival rates were predicted with 68% accuracy.

# Part 2

#### create a random forest model of the Titanic dataset that predicts survival. Interpret the confusion matrix and classification report. How did the predictive value change from the decision tree?

#### creating a random forest model

In [77]:
forest = RandomForestClassifier(n_estimators=500)
forest.fit(x_train, y_train)

RandomForestClassifier(n_estimators=500)

In [79]:
RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=500, n_jobs=None,
            oob_score=False, verbose=0, warm_start=False)

RandomForestClassifier(n_estimators=500)

#### evaluate model fit, create a prediction set and print a report.

In [80]:
forestPredictions = forest.predict(x_test)
print(confusion_matrix(y_test, forestPredictions))
print(classification_report(y_test, forestPredictions))

[[110  22]
 [ 29  54]]
              precision    recall  f1-score   support

           0       0.79      0.83      0.81       132
           1       0.71      0.65      0.68        83

    accuracy                           0.76       215
   macro avg       0.75      0.74      0.75       215
weighted avg       0.76      0.76      0.76       215

# There was no change at all between the random forest and the decision tree report data.